Revit 2027 API
CylindricalSurface Properties
The CylindricalSurface type exposes the following members.
Properties
Name | Description
Axis |  Axis of the cylinder. This is the Z axis of the local coordinate system associated with this cylinder.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Surface)
OrientationMatchesParametricOrientation |  Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation.
(Inherited from Surface)
Origin |  Center of the circle that defines the base of the cylinder. This is the origin of the local coordinate system associated with this cylinder.
Radius |  Radius of the circle that defines the base of this cylinder.
XDir |  X axis of the local coordinate system associated with this cylinder.
YDir |  Y axis of the local coordinate system associated with this cylinder.
Top
See Also
Reference
CylindricalSurface Class
Autodesk.Revit.DB Namespace